In [28]:
import numpy as np

In [29]:
import pandas as pd

# Pandas

1. Series
2. DataFrame

In [46]:
label = ["a","b","c"]
mylist = [10,20,30]
arr = np.array([10,20,30])
d = {"a":10,"b":20,"c":30,"d":40}

In [47]:
label

['a', 'b', 'c']

In [48]:
mylist

[10, 20, 30]

In [49]:
arr

array([10, 20, 30])

In [50]:
d

{'a': 10, 'b': 20, 'c': 30, 'd': 40}

In [54]:
ser1 = pd.Series(label)

In [55]:
ser2 = pd.Series(mylist)

In [56]:
ser1

0    a
1    b
2    c
dtype: object

In [57]:
ser2

0    10
1    20
2    30
dtype: int64

In [58]:
type(ser1)

pandas.core.series.Series

In [59]:
pd.Series(mylist, index= label)

a    10
b    20
c    30
dtype: int64

In [60]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [61]:
pd.Series(arr, label)

a    10
b    20
c    30
dtype: int32

In [62]:
pd.Series(d)

a    10
b    20
c    30
d    40
dtype: int64

In [63]:
ser3 = pd.Series([1,2,3,4], index=["Ind", "Pak", "Jap","Nz"])

In [64]:
ser4 = pd.Series([5,6,7,8], index=["Ind", "Jap","Nz", "USA"])

In [65]:
ser4

Ind    5
Jap    6
Nz     7
USA    8
dtype: int64

In [66]:
ser3

Ind    1
Pak    2
Jap    3
Nz     4
dtype: int64

In [67]:
ser3[2]

3

In [68]:
ser4[2]

7

In [69]:
ser3 + ser4

Ind     6.0
Jap     9.0
Nz     11.0
Pak     NaN
USA     NaN
dtype: float64

# DataFrame

In [77]:
from numpy.random import randn
np.random.seed(101)

In [79]:
df = pd.DataFrame(randn(5,4), index = "a b c d e".split(), columns= "w x y z".split())

In [80]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [82]:
df["w"]

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [83]:
df[["w","x"]]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318
c -2.018168  0.740122
d  0.188695 -0.758872
e  0.190794  1.978757

In [86]:
type(df[["w","x"]])

pandas.core.frame.DataFrame

In [87]:
df["new"] = df["w"] + df["x"]

In [89]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [96]:
df.drop("new",axis = 1)

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [97]:
df.drop("a")

          w         x         y         z       new
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [98]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [99]:
df.drop("new", axis=1, inplace = True)

In [100]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [101]:
df["w"]

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [102]:
df["a"]

KeyError: 'a'

In [103]:
df.loc["a"]

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [105]:
df.iloc[0]

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [109]:
df.loc[["a","b"]]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965

In [110]:
df.loc[["a","b"],["w","x"]]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318

In [111]:
df["w"]>1

a     True
b    False
c    False
d    False
e    False
Name: w, dtype: bool

In [112]:
df > 1

       w      x      y      z
a   True  False  False  False
b  False  False  False  False
c  False  False  False  False
d  False  False  False  False
e  False   True   True  False

In [113]:
df[df>1]

         w         x         y   z
a  2.70685       NaN       NaN NaN
b      NaN       NaN       NaN NaN
c      NaN       NaN       NaN NaN
d      NaN       NaN       NaN NaN
e      NaN  1.978757  2.605967 NaN

In [122]:
df[df["w"]<1] [["x","y"]]

          x         y
b -0.319318 -0.848077
c  0.740122  0.528813
d -0.758872 -0.933237
e  1.978757  2.605967

In [128]:
df[(df["w"]>0) & (df['y'] < 3)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [136]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [137]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [138]:
df.shape

(5, 4)

In [139]:
df.reset_index().shape

(5, 5)

In [141]:
df.set_index("w")

                  x         y         z
w
 2.706850  0.628133  0.907969  0.503826
 0.651118 -0.319318 -0.848077  0.605965
-2.018168  0.740122  0.528813 -0.589001
 0.188695 -0.758872 -0.933237  0.955057
 0.190794  1.978757  2.605967  0.683509

In [143]:
df.set_index("w").shape

(5, 3)

In [144]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [145]:
df["new"] = "TG MH KA DL TN".split()

In [148]:
df["new2" , axis = 0] = "TG MH KA DL TN".split()

SyntaxError: invalid syntax (<ipython-input-148-4d682aec79c7>, line 1)

In [150]:
data = [1,2,3,4]

In [151]:
data1 = pd.Series(data)

In [152]:
data1

0    1
1    2
2    3
3    4
dtype: int64

In [156]:
df

          w         x         y         z new
a  2.706850  0.628133  0.907969  0.503826  TG
b  0.651118 -0.319318 -0.848077  0.605965  MH
c -2.018168  0.740122  0.528813 -0.589001  KA
d  0.188695 -0.758872 -0.933237  0.955057  DL
e  0.190794  1.978757  2.605967  0.683509  TN

In [157]:
df.set_index("new")

            w         x         y         z
new
TG   2.706850  0.628133  0.907969  0.503826
MH   0.651118 -0.319318 -0.848077  0.605965
KA  -2.018168  0.740122  0.528813 -0.589001
DL   0.188695 -0.758872 -0.933237  0.955057
TN   0.190794  1.978757  2.605967  0.683509

# Missing data

In [159]:
df = pd.DataFrame({"a": [1,2,np.nan], "b": [5,np.nan,np.nan], "c": [1,2,3]})

In [160]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [161]:
df.dropna()

     a    b  c
0  1.0  5.0  1

In [162]:
df.dropna(axis=1)

   c
0  1
1  2
2  3

In [163]:
df.fillna("fill value")

            a           b  c
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [164]:
df.fillna(df["a"].mean())

     a    b  c
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

# Groupby

In [165]:
df = pd.DataFrame({"company": ["Zeta", "Genpact", "tata", "Zeta", "Genpact", "tata"], "Persons": ["raj", "roshan", "Ravi", "Sam", "Leo", "Vinay"], "Rating": [500,300,200,400,600,900]})

In [166]:
df

   company Persons  Rating
0     Zeta     raj     500
1  Genpact  roshan     300
2     tata    Ravi     200
3     Zeta     Sam     400
4  Genpact     Leo     600
5     tata   Vinay     900

In [168]:
df1 = df.groupby("company")

In [173]:
df1.mean()

         Rating
company
Genpact     450
Zeta        450
tata        550

In [179]:
df1.describe()

        Rating
         count   mean         std    min    25%    50%    75%    max
company
Genpact    2.0  450.0  212.132034  300.0  375.0  450.0  525.0  600.0
Zeta       2.0  450.0   70.710678  400.0  425.0  450.0  475.0  500.0
tata       2.0  550.0  494.974747  200.0  375.0  550.0  725.0  900.0

In [181]:
df1.min(
)

        Persons  Rating
company
Genpact     Leo     300
Zeta        Sam     400
tata       Ravi     200

In [182]:
df1.max()

        Persons  Rating
company
Genpact  roshan     600
Zeta        raj     500
tata      Vinay     900

In [184]:
df1.var()

         Rating
company
Genpact   45000
Zeta       5000
tata     245000

In [186]:
df1.count()

         Persons  Rating
company
Genpact        2       2
Zeta           2       2
tata           2       2

In [192]:
df1.describe().transpose()

company          Genpact        Zeta        tata
Rating count    2.000000    2.000000    2.000000
       mean   450.000000  450.000000  550.000000
       std    212.132034   70.710678  494.974747
       min    300.000000  400.000000  200.000000
       25%    375.000000  425.000000  375.000000
       50%    450.000000  450.000000  550.000000
       75%    525.000000  475.000000  725.000000
       max    600.000000  500.000000  900.000000

# operations

In [193]:
df

   company Persons  Rating
0     Zeta     raj     500
1  Genpact  roshan     300
2     tata    Ravi     200
3     Zeta     Sam     400
4  Genpact     Leo     600
5     tata   Vinay     900

In [202]:
df["Persons"].unique()

array(['raj', 'roshan', 'Ravi', 'Sam', 'Leo', 'Vinay'], dtype=object)

In [201]:
df["Persons"].nunique()

6

In [203]:
df["Rating"].sum()

2900

In [208]:
df["Persons"].value_counts()

Ravi      1
raj       1
roshan    1
Vinay     1
Leo       1
Sam       1
Name: Persons, dtype: int64

In [209]:
del df["Persons"]

In [210]:
df

   company  Rating
0     Zeta     500
1  Genpact     300
2     tata     200
3     Zeta     400
4  Genpact     600
5     tata     900

In [213]:
df.columns

Index(['company', 'Rating'], dtype='object')

In [214]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [216]:
df.sort_values("Rating")

   company  Rating
2     tata     200
1  Genpact     300
3     Zeta     400
0     Zeta     500
4  Genpact     600
5     tata     900

In [218]:
df.isnull()

   company  Rating
0    False   False
1    False   False
2    False   False
3    False   False
4    False   False
5    False   False